SunCity/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <attributes>
    <name>ПредставлениеШтрихкода</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Справки2ЕГАИС</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/Enums/ТипыИнформационныхКарт/ТипыИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИнформационныхКарт</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Дисконтная</name>
  </enumValues>
  <enumValues>
    <name>Регистрационная</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ВидыИнформационныхКарт/ВидыИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИнформационныхКарт</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Штриховая</name>
  </enumValues>
  <enumValues>
    <name>Магнитная</name>
  </enumValues>
  <enumValues>
    <name>Смешанная</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификационныйКодЛичности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбратныйНомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КБЕ</name>
    <comment>(Регл) Код признака резидентства и сектора экономики (КБЕ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПоНДС</name>
    <comment>Номер свидетельства плательщика НДС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияСвидетельстваПоНДС</name>
    <comment>Серия свидетельства плательщика НДС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСИК</name>
    <comment>Социальный индивидуальный код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСвидетельстваПоНДС</name>
    <comment>Дата получения свидетельства плательщика НДС</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикОплаты</name>
    <type>
      <types>CatalogRef.ГрафикиОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСистемаНалогообложения</name>
    <type>
      <types>EnumRef.УдалитьСистемыНалогообложения</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастникЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбратныйНомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/CommonModules/ИнформационныеКартыВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ИнформационныеКартыВызовСервера содержит процедуры и функции 
// для работы с информационными рассылками.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет, нужно ли проводить опрос владельца проверяемой карты на указанную дату.
//
// Параметры:
//  Карта - СправочникСсылка.ИнформационныеКарты - ссылка на проверяемую карту.
//  ДатаСобытия - Дата - дата проверки.
//
// Возвращаемое значение
//  Булево - Истина - нужно проводить опрос, Ложь - иначе.
//
Функция НеобходимостьОпросаВладельца(Карта, ДатаСобытия) Экспорт
	
	ЕстьНеобходимость = Ложь;
	ПользователюМожноПроводитьОпрос = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(
										ПланыВидовХарактеристик.ПраваПользователей.ПроводитьОпросВладельцевДисконтныхКартПриОформленииДокументов,
										Ложь);
	
	Если ПользователюМожноПроводитьОпрос Тогда
		
		СтруктураРеквизитовКарты = Новый Структура;
		СтруктураРеквизитовКарты.Вставить("ДатаСледующегоОпроса", "ДатаСледующегоОпроса");
		СтруктураРеквизитовКарты.Вставить("ТипКарты", "ТипКарты");
		РеквизитыКарты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Карта, СтруктураРеквизитовКарты);
		ДатаСледующегоОпроса = РеквизитыКарты.ДатаСледующегоОпроса;
		ТипКарты = РеквизитыКарты.ТипКарты;
		
		Если ЗначениеЗаполнено(Карта.ДатаСледующегоОпроса) 
			И ДатаСобытия >= ДатаСледующегоОпроса 
			И ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная Тогда
			
			ЕстьНеобходимость = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьНеобходимость;
	
КонецФункции // НеобходимостьОпросаВладельца()

// Возвращает текст запроса поиска дисконтной карты
//
// Параметры:
//  РежимПоискаКарты - Число - число режима поиска дисконтной карты.
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ТекстЗапросаПоискаКарты(РежимПоискаКарты) Экспорт
	
	Если РежимПоискаКарты = 1 Тогда
		// Поиск по номеру телефона.
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ Владельцы
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	(КонтактнаяИнформация.НомерТелефона = &ВведенноеЧисло
		|			ИЛИ КонтактнаяИнформация.НомерТелефона = &ВведенноеЧислоСВосьмеркой)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка,
		|	КонтактнаяИнформация.НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	(КонтактнаяИнформация.НомерТелефона = &ВведенноеЧисло
		|			ИЛИ КонтактнаяИнформация.НомерТелефона = &ВведенноеЧислоСВосьмеркой)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	КонтактнаяИнформацияФЛ.НомерТелефона,
		|	КонтактнаяИнформацияФЛ.АдресЭП
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияФЛ
		|		ПО Контрагенты.ФизЛицо = КонтактнаяИнформацияФЛ.Ссылка
		|			И (КонтактнаяИнформацияФЛ.НомерТелефона = &ВведенноеЧисло
		|				ИЛИ КонтактнаяИнформацияФЛ.НомерТелефона = &ВведенноеЧислоСВосьмеркой)
		|ГДЕ
		|	Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Ссылка.ВладелецКарты КАК ВладелецКарты,
		|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ КартыИзКонтактнойИнформации
		|ИЗ
		|	Справочник.ИнформационныеКарты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	(КонтактнаяИнформация.НомерТелефона = &ВведенноеЧисло
		|			ИЛИ КонтактнаяИнформация.НомерТелефона = &ВведенноеЧислоСВосьмеркой)
		|	И КонтактнаяИнформация.Ссылка.ТипКарты = &ТипКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка,
		|	Владельцы.Ссылка КАК ВладелецКарты,
		|	Владельцы.НомерТелефона КАК НомерТелефона,
		|	Владельцы.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ ТаблицаКарт
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК Карты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Владельцы КАК Владельцы
		|		ПО (Владельцы.Ссылка = Карты.ВладелецКарты)
		|ГДЕ
		|	Карты.ТипКарты = &ТипКарты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыИзКонтактнойИнформации.Ссылка,
		|	КартыИзКонтактнойИнформации.ВладелецКарты,
		|	КартыИзКонтактнойИнформации.НомерТелефона,
		|	КартыИзКонтактнойИнформации.АдресЭП
		|ИЗ
		|	КартыИзКонтактнойИнформации КАК КартыИзКонтактнойИнформации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаКарт.Ссылка КАК Ссылка,
		|	ТаблицаКарт.ВладелецКарты КАК ВладелецКарты,
		|	ТаблицаКарт.НомерТелефона КАК НомерТелефона,
		|	ТаблицаКарт.АдресЭП КАК АдресЭП
		|ИЗ
		|	ТаблицаКарт КАК ТаблицаКарт";
	ИначеЕсли РежимПоискаКарты = 2 Тогда
		// Поиск по ФИО.
		ТекстЗапроса = "ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Владельцы
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование ПОДОБНО &Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка,
		|	Владельцы.Ссылка КАК ВладелецКарты,
		|	ЕСТЬNULL(КонтактнаяИнформацияВладельца.НомерТелефона, """") КАК НомерТелефона,
		|	ЕСТЬNULL(КонтактнаяИнформацияВладельца.АдресЭП, """") КАК АдресЭП
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК Карты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Владельцы КАК Владельцы
		|		ПО (Владельцы.Ссылка = Карты.ВладелецКарты)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияВладельца
		|		ПО (Владельцы.Ссылка = КонтактнаяИнформацияВладельца.Ссылка)
		|			И (КонтактнаяИнформацияВладельца.Тип В (&ТипыИнформации))
		|ГДЕ
		|	Карты.ТипКарты = &ТипКарты";
		
	ИначеЕсли РежимПоискаКарты = 3 Тогда
		// Поиск по E-mail.
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ Владельцы
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.АдресЭП ПОДОБНО &АдресЭП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка,
		|	КонтактнаяИнформация.НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.АдресЭП ПОДОБНО &АдресЭП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	КонтактнаяИнформацияФЛ.НомерТелефона,
		|	КонтактнаяИнформацияФЛ.АдресЭП
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияФЛ
		|		ПО Контрагенты.ФизЛицо = КонтактнаяИнформацияФЛ.Ссылка
		|			И (КонтактнаяИнформацияФЛ.АдресЭП ПОДОБНО &АдресЭП)
		|ГДЕ
		|	Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактнаяИнформация.Ссылка.ВладелецКарты КАК ВладелецКарты,
		|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ КартыИзКонтактнойИнформации
		|ИЗ
		|	Справочник.ИнформационныеКарты.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.АдресЭП ПОДОБНО &АдресЭП
		|	И КонтактнаяИнформация.Ссылка.ТипКарты = &ТипКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка,
		|	Владельцы.Ссылка КАК ВладелецКарты,
		|	Владельцы.НомерТелефона КАК НомерТелефона,
		|	Владельцы.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ ТаблицаКарт
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК Карты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Владельцы КАК Владельцы
		|		ПО (Владельцы.Ссылка = Карты.ВладелецКарты)
		|ГДЕ
		|	Карты.ТипКарты = &ТипКарты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КартыИзКонтактнойИнформации.Ссылка,
		|	КартыИзКонтактнойИнформации.ВладелецКарты,
		|	КартыИзКонтактнойИнформации.НомерТелефона,
		|	КартыИзКонтактнойИнформации.АдресЭП
		|ИЗ
		|	КартыИзКонтактнойИнформации КАК КартыИзКонтактнойИнформации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаКарт.Ссылка КАК Ссылка,
		|	ТаблицаКарт.ВладелецКарты КАК ВладелецКарты,
		|	ТаблицаКарт.НомерТелефона КАК НомерТелефона,
		|	ТаблицаКарт.АдресЭП КАК АдресЭП
		|ИЗ
		|	ТаблицаКарт КАК ТаблицаКарт";
	Иначе
		// Поиск по коду карты или штрихкоду
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Карты.Ссылка КАК Ссылка,
		|	Карты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК Карты
		|ГДЕ
		|	Карты.ТипКарты = &ТипКарты
		|	И Карты.КодКарты = &ВводимоеЧисло
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Штрихкоды.Владелец КАК Ссылка,
		|	Штрихкоды.Владелец.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец.ТипКарты = &ТипКарты
		|	И Штрихкоды.Штрихкод = &ВводимоеЧисло
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Программно создает новую дисконтную карту.
//
// Параметры:
//  СтруктураПараметров - Структура - данные для заполнения реквизитов создаваемой карты.
//
// Возвращаемое значение:
//  СправочникСсылка.ИнформационныеКарты - ссылка на созданную карту
//                    в случае возникновения исключительной ситуации возвращается пустая ссылка.
//
Функция НоваяДисконтнаяКарта(СтруктураПараметров) Экспорт
	
	ВыполненоУспешно = Ложь;
	Штрихкод = "";
	
	НачатьТранзакцию();
	Попытка
		
		ИнформационнаяКарта = Справочники.ИнформационныеКарты.СоздатьЭлемент();
		ИнформационнаяКарта.Наименование = СтруктураПараметров.КодКарты;
		
		ИнформационнаяКарта.ВидКарты = СтруктураПараметров.ВидКарты;
		ИнформационнаяКарта.ДатаОткрытия = ТекущаяДатаСеанса();
		ИнформационнаяКарта.Родитель = СтруктураПараметров.ГруппаКарты;
		ИнформационнаяКарта.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная;
		
		Если СтруктураПараметров.ВидКарты <> Перечисления.ВидыИнформационныхКарт.Штриховая Тогда
			ИнформационнаяКарта.КодКарты = СтруктураПараметров.КодКарты;
		КонецЕсли;
		
		ИнформационнаяКарта.ВидДисконтнойКарты = СтруктураПараметров.ВидДисконтнойКарты;
		ИнформационнаяКарта.БонуснаяПрограммаЛояльности = СтруктураПараметров.БонуснаяПрограммаЛояльности;
		
		Если СтруктураПараметров.Свойство("ПроводитьОпросВладельцаПриРегистрации")
			И СтруктураПараметров.ПроводитьОпросВладельцаПриРегистрации Тогда
			ИнформационнаяКарта.ДатаСледующегоОпроса = ИнформационнаяКарта.ДатаОткрытия;
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("ГруппаВладельцаКарты") Тогда
			ИнформационнаяКарта.ГруппаВладельцаКартыПоШаблону = СтруктураПараметров.ГруппаВладельцаКарты;
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("ВладелецКарты") Тогда 
			ИнформационнаяКарта.ВладелецКарты = СтруктураПараметров.ВладелецКарты;
		Иначе 
			ИнформационнаяКарта.ВладелецКарты = Справочники.ФизическиеЛица.ПустаяСсылка();
		КонецЕсли;
				
		Если СтруктураПараметров.Свойство("НомерТелефона") Тогда
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(
				ИнформационнаяКарта,
				СтруктураПараметров.НомерТелефона,
				Справочники.ВидыКонтактнойИнформации.ТелефонИнформационнойКарты);
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("АдресЭП") Тогда
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(
				ИнформационнаяКарта,
				СтруктураПараметров.АдресЭП,
				Справочники.ВидыКонтактнойИнформации.EmailИнформационнойКарты);
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("КартаГУИДСтрокой") И ЗначениеЗаполнено(СтруктураПараметров.КартаГУИДСтрокой) Тогда
			КартаГУИД = Новый УникальныйИдентификатор(СтруктураПараметров.КартаГУИДСтрокой);
			КартаСсылка = Справочники.ИнформационныеКарты.ПолучитьСсылку(КартаГУИД);
			ИнформационнаяКарта.УстановитьСсылкуНового(КартаСсылка);
		КонецЕсли;
		ИнформационнаяКарта.Записать();
		
		Если СтруктураПараметров.ВидКарты <> Перечисления.ВидыИнформационныхКарт.Магнитная Тогда
			
			МенеджерЗаписи = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Штрихкод = СтруктураПараметров.КодКарты;
			МенеджерЗаписи.Владелец = ИнформационнаяКарта.Ссылка;
			Если ЗначениеЗаполнено(СтруктураПараметров.ТипШтрихкода) Тогда
				МенеджерЗаписи.ТипШтрихкода = СтруктураПараметров.ТипШтрихкода;
			Иначе
				МенеджерЗаписи.ТипШтрихкода = ПодключаемоеОборудованиеРТ.ТипШтрихкода(СтруктураПараметров.КодКарты);
			КонецЕсли;

			МенеджерЗаписи.Записать(Истина);
			Штрихкод = СтруктураПараметров.КодКарты;
			
		КонецЕсли;
		
		ВыполненоУспешно = Истина;
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Инфо = ИнформацияОбОшибке();
		ТекстСообщенияОбОшибке = НСтр("ru = 'Ошибка при создании информационной карты: %1'");
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									ТекстСообщенияОбОшибке,
									КраткоеПредставлениеОшибки(Инфо));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Маркетинг.Создание дисконтной карты'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			ПодробноеПредставлениеОшибки(Инфо));
		ВыполненоУспешно = Ложь;
		
	КонецПопытки;
	
	СсылкаРезультат = Справочники.ИнформационныеКарты.ПустаяСсылка();
	Если ВыполненоУспешно Тогда
		СсылкаРезультат = ИнформационнаяКарта.Ссылка;
	КонецЕсли;
	
	СтруктураКарты = Новый Структура;
	СтруктураКарты.Вставить("ДанныеПО", СтруктураПараметров.КодКарты);
	СтруктураКарты.Вставить("Штрихкод", Штрихкод);
	СтруктураКарты.Вставить("МагнитныйКод", СтруктураПараметров.КодКарты);
	СтруктураКарты.Вставить("Карта", СсылкаРезультат);
	СтруктураКарты.Вставить("ТипКарты", Перечисления.ТипыИнформационныхКарт.Дисконтная);
	СтруктураКарты.Вставить("ВладелецКарты", СсылкаРезультат.ВладелецКарты);
	СтруктураКарты.Вставить("ЭтоРегистрационнаяКарта", Ложь);
	
	Возврат СтруктураКарты;
	
КонецФункции

#КонецОбласти
